cases/aeration/CaseA_Distributed/0/DO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      DO;
}

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.0005;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0005;
    }

    outlet
    {
        type            zeroGradient;
    }

    sideWalls
    {
        type            zeroGradient;
    }

    floor
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    diffusers
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
