cases/aeration/CaseA_Distributed/0/U.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.000858 0 0);
    }

    outlet
    {
        type            matchedFlowRateOutletVelocity;
        inletPatch      inlet;
        volumetric      true;
        value           uniform (0.000858 0 0);
    }

    sideWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

	atmosphere
	{
		type            pressureInletOutletVelocity;
		phi             phi.water;
		value           uniform (0 0 0);
	}

    diffusers
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
