cases/aeration/CaseA_Distributed/system/alphaUwaterDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                       |
|  \\    /   O peration     | Version:  v2412                                |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      alphaUwaterDict;
}

functions
{
    readTransportFields
    {
        type            readFields;
        libs            (fieldFunctionObjects);

        fields
        (
            alpha.water
            U.water
        );
    }

    alphaUwater
    {
        type            multiply;
        libs            (fieldFunctionObjects);

        fields
        (
            alpha.water
            U.water
        );

        result          alphaUwater;
    }
}

// ************************************************************************* //
